zoubata/ArduinoCore-samd/variants/Pilo/variant.h
#define P_COM2_P0_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define P_COM2_P1_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define P_COM2_P2_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM2_P3_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM2_P4_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM2_P5_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)

#define P_COM3_P0_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM3_P1_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM3_P2_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define P_COM3_P3_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define P_COM3_P4_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM3_P5_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)

#define P_COM4_P0_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM4_P1_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM4_P2_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM4_P3_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM4_P4_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM4_P5_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)

#define P_COM5_P0_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM5_P1_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM5_P2_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM5_P3_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM5_P4_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM5_P5_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)

















#define CAN_5V_PIN_ATTRIB     (PIN_ATTR_SERCOM | PIN_ATTR_DIGITAL)
#define CAN_3V_PIN_ATTRIB     (PIN_ATTR_SERCOM | PIN_ATTR_DIGITAL)



#define PANA1_G_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define PANA1_P0_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define PANA1_P2_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define PANA1_P4_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)




#define PANA2_G_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_DIGITAL)
#define PANA2_P0_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_DIGITAL)
#define PANA2_P2_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_DIGITAL)
#define PANA2_P4_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_DIGITAL)



// arduino ATTRIBUTE based on Pcom pin name (not yet manage : PIN_ATTR_ADC , PIN_ATTR_DAC , PIN_ATTR_REF , PIN_ATTR_AC)
//==================================
#define P_COM0_P0_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM0_P1_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM0_P2_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM0_P3_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM0_P4_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM0_P5_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)

#define P_COM0_BIS_P0_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM0_BIS_P1_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM0_BIS_P2_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM0_BIS_P3_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM0_BIS_P4_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM0_BIS_P5_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)

#define P_COM1_P0_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM1_P1_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM1_P2_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM1_P3_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM1_P4_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM1_P5_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)

#define P_COM2_P0_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM2_P1_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM2_P2_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM2_P3_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM2_P4_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM2_P5_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)

#define P_COM3_P0_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM3_P1_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM3_P2_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM3_P3_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM3_P4_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM3_P5_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)

#define P_COM4_P0_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM4_P1_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM4_P2_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM4_P3_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM4_P4_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM4_P5_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)

#define P_COM5_P0_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM5_P1_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM5_P2_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM5_P3_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define P_COM5_P4_PER_ATTRIB     (PER_ATTR_DRIVE_STRONG)
#define P_COM5_P5_PER_ATTRIB     (PER_ATTR_DRIVE_STRONG)

















