zoubata/ArduinoCore-samd/variants/Pilo/variant.h
#define CAN_5V_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_DRIVE_STRONG)
#define CAN_3V_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_DRIVE_STRONG)



#define PANA1_G_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define PANA1_P0_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define PANA1_P2_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)
#define PANA1_P4_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_TIMER_STD | PER_ATTR_DRIVE_STRONG)



#define PANA2_G_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_DRIVE_STRONG)
#define PANA2_P0_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_DRIVE_STRONG)
#define PANA2_P2_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_DRIVE_STRONG)
#define PANA2_P4_PER_ATTRIB     (PER_ATTR_SERCOM_STD | PER_ATTR_DRIVE_STRONG)



#define ADC_RESOLUTION		12
/* Reference voltage pins (define even if not enabled with PIN_ATTR_REF in the PinDescription table) */
#define REFA_PIN    (3ul)
#define REFB_PIN    (4ul)

// The ATN pin may be used in the future as the first SPI chip select.
// On boards that do not have the Arduino physical form factor, it can to set to any free pin.

#define PIN_ATN              (38ul)
static const uint8_t ATN = PIN_ATN;




/*
 * SPI Interfaces
 */

//SPI definition				
//------------------------------				
#define SPI_INTERFACES_COUNT 6

#define       PIN_SPI0_MISO          (0u)
#define       PIN_SPI0_SCK          (1u)
#define       PIN_SPI0_SS          (2u)
#define       PIN_SPI0_MOSI          (3u)
#define       PERIPH_SPI0          sercom0


#define       PIN_SPI0_BIS_MISO          (6u)
#define       PIN_SPI0_BIS_SCK          (7u)
#define       PIN_SPI0_BIS_SS          (8u)
#define       PIN_SPI0_BIS_MOSI          (9u)
#define       PERIPH_SPI0_BIS          sercom0


#define       PIN_SPI1_MISO          (12u)
#define       PIN_SPI1_SCK          (13u)
#define       PIN_SPI1_SS          (14u)
#define       PIN_SPI1_MOSI          (15u)
#define       PERIPH_SPI1          sercom1


#define       PIN_SPI2_MISO          (18u)
#define       PIN_SPI2_SCK          (19u)
#define       PIN_SPI2_SS          (20u)
#define       PIN_SPI2_MOSI          (21u)
#define       PERIPH_SPI2          sercom2


#define       PIN_SPI3_MISO          (24u)
#define       PIN_SPI3_SCK          (25u)
#define       PIN_SPI3_SS          (26u)
#define       PIN_SPI3_MOSI          (27u)
#define       PERIPH_SPI3          sercom3


#define       PIN_SPI4_MISO          (30u)
#define       PIN_SPI4_SCK          (31u)
#define       PIN_SPI4_SS          (32u)
#define       PIN_SPI4_MOSI          (33u)
#define       PERIPH_SPI4          sercom4


#define       PIN_SPI5_MISO          (36u)
#define       PIN_SPI5_SCK          (37u)
#define       PIN_SPI5_SS          (38u)
#define       PIN_SPI5_MOSI          (39u)
#define       PERIPH_SPI5          sercom5
			
				
				
				
				
				
				
				
				
				
				

						
						
#define	PAD_SPI0_TX	SPI_PAD_3_SCK_1				
#define	PAD_SPI0_RX	SERCOM_RX_PAD_0				
#define	PAD_SPI1_TX	SPI_PAD_3_SCK_1				
#define	PAD_SPI1_RX	SERCOM_RX_PAD_0				
#define	PAD_SPI2_TX	SPI_PAD_3_SCK_1				
#define	PAD_SPI2_RX	SERCOM_RX_PAD_0				
#define	PAD_SPI3_TX	SPI_PAD_3_SCK_1				
#define	PAD_SPI3_RX	SERCOM_RX_PAD_0				
#define	PAD_SPI4_TX	SPI_PAD_3_SCK_1				
#define	PAD_SPI4_RX	SERCOM_RX_PAD_0				
#define	PAD_SPI5_TX	SPI_PAD_3_SCK_1				
#define	PAD_SPI5_RX	SERCOM_RX_PAD_0				
#define	PAD_SPI0_BIS_TX	SPI_PAD_3_SCK_1				
#define	PAD_SPI0_BIS_RX	SERCOM_RX_PAD_0				
static	const	uint8_t	SS0	=	PIN_SPI0_SS	;
static	const	uint8_t	MOSI0	=	PIN_SPI0_MOSI	;
static	const	uint8_t	MISO0	=	PIN_SPI0_MISO	;
static	const	uint8_t	SCK0	=	PIN_SPI0_SCK	;
static	const	uint8_t	SS1	=	PIN_SPI1_SS	;
static	const	uint8_t	MOSI1	=	PIN_SPI1_MOSI	;
static	const	uint8_t	MISO1	=	PIN_SPI1_MISO	;
static	const	uint8_t	SCK1	=	PIN_SPI1_SCK	;
static	const	uint8_t	SS2	=	PIN_SPI2_SS	;
static	const	uint8_t	MOSI2	=	PIN_SPI2_MOSI	;
static	const	uint8_t	MISO2	=	PIN_SPI2_MISO	;
static	const	uint8_t	SCK2	=	PIN_SPI2_SCK	;
static	const	uint8_t	SS3	=	PIN_SPI3_SS	;
static	const	uint8_t	MOSI3	=	PIN_SPI3_MOSI	;
static	const	uint8_t	MISO3	=	PIN_SPI3_MISO	;
static	const	uint8_t	SCK3	=	PIN_SPI3_SCK	;
static	const	uint8_t	SS4	=	PIN_SPI4_SS	;
static	const	uint8_t	MOSI4	=	PIN_SPI4_MOSI	;
static	const	uint8_t	MISO4	=	PIN_SPI4_MISO	;
static	const	uint8_t	SCK4	=	PIN_SPI4_SCK	;
static	const	uint8_t	SS5	=	PIN_SPI5_SS	;
static	const	uint8_t	MOSI5	=	PIN_SPI5_MOSI	;
static	const	uint8_t	MISO5	=	PIN_SPI5_MISO	;
static	const	uint8_t	SCK5	=	PIN_SPI5_SCK	;
static	const	uint8_t	SS0_BIS	=	PIN_SPI0_BIS_SS	;
static	const	uint8_t	MOSI0_BIS	=	PIN_SPI0_BIS_MOSI	;
static	const	uint8_t	MISO0_BIS	=	PIN_SPI0_BIS_MISO	;
static	const	uint8_t	SCK0_BIS	=	PIN_SPI0_BIS_SCK	;
 //alias to 0						
#define	PIN_SPI_MISO	PIN_SPI0_MISO				
#define	PIN_SPI_MOSI	PIN_SPI0_MOSI				
#define	PIN_SPI_SCK	PIN_SPI0_SCK				
#define	PIN_SPI_SS	PIN_SPI0_SS				
#define	PERIPH_SPI	PERIPH_SPI0				
#define	PAD_SPI_TX	PAD_SPI0_TX				
#define	PAD_SPI_RX	PAD_SPI0_RX				
						
static	const	uint8_t	SS	=	PIN_SPI_SS	;
static	const	uint8_t	MOSI	=	PIN_SPI_MOSI	;
static	const	uint8_t	MISO	=	PIN_SPI_MISO	;
static	const	uint8_t	SCK	=	PIN_SPI_SCK	;
						
						


/*
 * Wire Interfaces
 */
 //WIRE definition						
//------------------------------						
#define	WIRE_INTERFACES_COUNT		6			
#define       PIN_WIRE0_SDA          (0u)						
#define       PIN_WIRE0_SCL          (1u)	
					
#define PERIPH_WIRE          PERIPH_WIRE0
#define WIRE_IT_HANDLER      WIRE0_IT_HANDLER
#define       WIRE0_IT_HANDLER          SERCOM0_Handler_softwire						
#define       PERIPH_WIRE0          sercom0						
						
						
						
#define       PIN_WIRE0_BIS_SDA          (6u)						
#define       PIN_WIRE0_BIS_SCL          (7u)						
#define       WIRE0_BIS_IT_HANDLER          SERCOM0Bis_Handler_softwire
#define       PERIPH_WIRE0_BIS          sercom0						
						
						
						
#define       PIN_WIRE1_SDA          (12u)						
#define       PIN_WIRE1_SCL          (13u)						
#define       WIRE1_IT_HANDLER          SERCOM1_Handler_softwire
#define       PERIPH_WIRE1          sercom1						
						
						
						
