zoubata/ArduinoCore-samd/variants/Pilo/variant.h
#define       PIN_WIRE2_SDA          (18u)						
#define       PIN_WIRE2_SCL          (19u)						
#define       WIRE2_IT_HANDLER          SERCOM2_Handler_softwire						
#define       PERIPH_WIRE2          sercom2						
						
						
						
#define       PIN_WIRE3_SDA          (24u)						
#define       PIN_WIRE3_SCL          (25u)						
#define       WIRE3_IT_HANDLER          SERCOM3_Handler_softwire
#define       PERIPH_WIRE3          sercom3						
						
						
						
#define       PIN_WIRE4_SDA          (30u)						
#define       PIN_WIRE4_SCL          (31u)						
#define       WIRE4_IT_HANDLER          SERCOM4_Handler_softwire
#define       PERIPH_WIRE4          sercom4						
						
						
						
#define       PIN_WIRE5_SDA          (36u)						
#define       PIN_WIRE5_SCL          (37u)						
#define       WIRE5_IT_HANDLER          SERCOM5_Handler_softwire
#define       PERIPH_WIRE5          sercom5						
						
						
						
						
						
						
						
						
						
						
						
						
						
						
						
						
						
						
#define	PIN_WIRE_SDA	PIN_WIRE0_SDA				
#define	PIN_WIRE_SCL	PIN_WIRE0_SCL				
#define	PERIPH_WIRE	PERIPH_WIRE0				
#define	WIRE_IT_HANDLER	WIRE0_IT_HANDLER				
static	const	uint8_t	SDA0	=	PIN_WIRE0_SDA;	
static	const	uint8_t	SCL0	=	PIN_WIRE0_SCL;	
static	const	uint8_t	SDA0_BIS	=	PIN_WIRE0_BIS_SDA;	
static	const	uint8_t	SCL0_BIS	=	PIN_WIRE0_BIS_SCL;	
static	const	uint8_t	SDA1	=	PIN_WIRE1_SDA;	
static	const	uint8_t	SCL1	=	PIN_WIRE1_SCL;	
static	const	uint8_t	SDA2	=	PIN_WIRE2_SDA;	
static	const	uint8_t	SCL2	=	PIN_WIRE2_SCL;	
static	const	uint8_t	SDA3	=	PIN_WIRE3_SDA;	
static	const	uint8_t	SCL3	=	PIN_WIRE3_SCL;	
static	const	uint8_t	SDA4	=	PIN_WIRE4_SDA;	
static	const	uint8_t	SCL4	=	PIN_WIRE4_SCL;	
static	const	uint8_t	SDA5	=	PIN_WIRE5_SDA;	
static	const	uint8_t	SCL5	=	PIN_WIRE5_SCL;	
static	const	uint8_t	SDA	=	PIN_WIRE_SDA;	
static	const	uint8_t	SCL	=	PIN_WIRE_SCL;	


  
  
 /*
#define WIRE_INTERFACES_COUNT 1

#define PIN_WIRE_SDA         (20u)
#define PIN_WIRE_SCL         (21u)
#define PERIPH_WIRE          sercom3
#define WIRE_IT_HANDLER      SERCOM3_Handler

static const uint8_t SDA = PIN_WIRE_SDA;
static const uint8_t SCL = PIN_WIRE_SCL;
*/
/*
 * USB
 */
#if (SAMD21 || SAML21)
#define PIN_USB_HOST_ENABLE (27ul)
#define PIN_USB_DM          (28ul)
#define PIN_USB_DP          (29ul)
#define PIN_USB_HOST_ENABLE_VALUE	HIGH
#endif

/*
 * I2S Interfaces
 */
#define I2S_INTERFACES_COUNT 1

#define I2S_DEVICE          0
#define I2S_CLOCK_GENERATOR 3
#define PIN_I2S_SD          (7u)
#define PIN_I2S_SCK         (10u)
#define PIN_I2S_FS          (11u)

#ifdef __cplusplus
}
#endif //// extern "C" {


//   SERCOM						
						
//   SERCOM						
//	Serial1					
#define	PAD_SERIAL0_TX	(UART_TX_PAD_0)				
#define	PAD_SERIAL0_RX	(SERCOM_RX_PAD_1)				
#define	PIN_SERIAL0_TX	(0ul)				
#define	PIN_SERIAL0_RX	(1ul)				
#define	SERCOM_INSTANCE_SERIAL0	&sercom0				
						
//	Serial1					
#define	PAD_SERIAL0_BIS_TX	(UART_TX_PAD_0)				
#define	PAD_SERIAL0_BIS_RX	(SERCOM_RX_PAD_1)				
#define	PIN_SERIAL0_BIS_TX	(6ul)				
#define	PIN_SERIAL0_BIS_RX	(7ul)				
#define	SERCOM_INSTANCE_SERIAL0_BIS	&sercom0				
						
//	Serial1					
#define	PAD_SERIAL1_TX	(UART_TX_PAD_0)				
#define	PAD_SERIAL1_RX	(SERCOM_RX_PAD_1)				
#define	PIN_SERIAL1_TX	(12ul)				
#define	PIN_SERIAL1_RX	(13ul)				
#define	SERCOM_INSTANCE_SERIAL1	&sercom1				
						
//	Serial1					
#define	PAD_SERIAL2_TX	(UART_TX_PAD_0)				
#define	PAD_SERIAL2_RX	(SERCOM_RX_PAD_1)				
#define	PIN_SERIAL2_TX	(18ul)				
#define	PIN_SERIAL2_RX	(19ul)				
#define	SERCOM_INSTANCE_SERIAL2	&sercom2				
						
//	Serial1					
#define	PAD_SERIAL3_TX	(UART_TX_PAD_0)				
#define	PAD_SERIAL3_RX	(SERCOM_RX_PAD_1)				
#define	PIN_SERIAL3_TX	(24ul)				
#define	PIN_SERIAL3_RX	(25ul)				
#define	SERCOM_INSTANCE_SERIAL3	&sercom3				
						
//	Serial1					
#define	PAD_SERIAL4_TX	(UART_TX_PAD_0)				
#define	PAD_SERIAL4_RX	(SERCOM_RX_PAD_1)				
#define	PIN_SERIAL4_TX	(30ul)				
#define	PIN_SERIAL4_RX	(31ul)				
#define	SERCOM_INSTANCE_SERIAL4	&sercom4				
						
//	Serial1					
#define	PAD_SERIAL5_TX	(UART_TX_PAD_0)				
#define	PAD_SERIAL5_RX	(SERCOM_RX_PAD_1)				
#define	PIN_SERIAL5_TX	(36ul)				
#define	PIN_SERIAL5_RX	(37ul)				
#define	SERCOM_INSTANCE_SERIAL5	&sercom5				
						
						
//	Serial	(EDBG)				
#define	PIN_SERIAL_RX	PAD_SERIAL0_TX				
#define	PIN_SERIAL_TX	PAD_SERIAL0_RX				
#define	PAD_SERIAL_TX	PIN_SERIAL0_TX				
#define	PAD_SERIAL_RX	PIN_SERIAL0_RX				
#define	SERCOM_INSTANCE_SERIAL	SERCOM_INSTANCE_SERIAL0				
//	Serial1					
#define	PAD_SERIAL_B0_TX	(UART_TX_PAD_2)				
#define	PAD_SERIAL_B0_RX	(SERCOM_RX_PAD_3)				
#define	PIN_SERIAL_B0_TX	(2ul)				
#define	PIN_SERIAL_B0_RX	(3ul)				
#define	SERCOM_INSTANCE_SERIAL_B0	&sercom0				
						
//	Serial1					
#define	PAD_SERIAL_B0_BIS_TX	(UART_TX_PAD_2)				
#define	PAD_SERIAL_B0_BIS_RX	(SERCOM_RX_PAD_3)				
#define	PIN_SERIAL_B0_BIS_TX	(8ul)				
#define	PIN_SERIAL_B0_BIS_RX	(9ul)				
#define	SERCOM_INSTANCE_SERIAL_B0_BIS	&sercom0				
						
//	Serial1					
#define	PAD_SERIAL_B1_TX	(UART_TX_PAD_2)				
#define	PAD_SERIAL_B1_RX	(SERCOM_RX_PAD_3)				
#define	PIN_SERIAL_B1_TX	(14ul)				
#define	PIN_SERIAL_B1_RX	(15ul)				
#define	SERCOM_INSTANCE_SERIAL_B1	&sercom1				
						
//	Serial1					
#define	PAD_SERIAL_B2_TX	(UART_TX_PAD_2)				
#define	PAD_SERIAL_B2_RX	(SERCOM_RX_PAD_3)				
#define	PIN_SERIAL_B2_TX	(20ul)				
#define	PIN_SERIAL_B2_RX	(21ul)				
#define	SERCOM_INSTANCE_SERIAL_B2	&sercom2				
						
//	Serial1					
#define	PAD_SERIAL_B3_TX	(UART_TX_PAD_2)				
#define	PAD_SERIAL_B3_RX	(SERCOM_RX_PAD_3)				
#define	PIN_SERIAL_B3_TX	(26ul)				
#define	PIN_SERIAL_B3_RX	(27ul)				
#define	SERCOM_INSTANCE_SERIAL_B3	&sercom3				
						
//	Serial1					
#define	PAD_SERIAL_B4_TX	(UART_TX_PAD_2)				
#define	PAD_SERIAL_B4_RX	(SERCOM_RX_PAD_3)				
#define	PIN_SERIAL_B4_TX	(32ul)				
#define	PIN_SERIAL_B4_RX	(33ul)				
#define	SERCOM_INSTANCE_SERIAL_B4	&sercom4				
						
//	Serial1					
#define	PAD_SERIAL_B5_TX	(UART_TX_PAD_2)				
#define	PAD_SERIAL_B5_RX	(SERCOM_RX_PAD_3)				
#define	PIN_SERIAL_B5_TX	(38ul)				
#define	PIN_SERIAL_B5_RX	(39ul)				
#define	SERCOM_INSTANCE_SERIAL_B5	&sercom5				






/*--------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/


#ifdef __cplusplus

/*	=========================
 *	===== SERCOM DEFINITION
 *	=========================
*/

extern SERCOM sercom0;
extern SERCOM sercom1;
extern SERCOM sercom2;
extern SERCOM sercom3;
extern SERCOM sercom4;
extern SERCOM sercom5;

extern Uart Serial0;
extern Uart Serial0_BIS;
extern Uart Serial1;
extern Uart Serial2;
extern Uart Serial3;
extern Uart Serial4;
extern Uart Serial5;


