zoubata/ArduinoCore-samd/variants/Pilo/variant.h
extern Uart Serial0B;
extern Uart Serial0_BIS_B;
extern Uart Serial1B;
extern Uart Serial2B;
extern Uart Serial3B;
extern Uart Serial4B;
extern Uart Serial5B;
#if defined(BOARD_ID_engi)
extern Uart SerialFTDI;
#endif
//#define SIX_UART 6

#endif

// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_USBVIRTUAL      SerialUSB
#define SERIAL_PORT_MONITOR         Serial
// Serial has no physical pins broken out, so it's not listed as HARDWARE port
#define SERIAL_PORT_HARDWARE        Serial1
#define SERIAL_PORT_HARDWARE_OPEN   Serial1

// The board does not have the EDBG support chip, which provides a USB-UART bridge
// accessible using Serial (the Arduino serial monitor is normally connected to this).
// So, the USB virtual serial port (SerialUSB) must be used to communicate with the host.
// Because most sketches use Serial to print to the monitor, it is aliased to SerialUSB.
// Remember to use while(!Serial); to wait for a connection before Serial printing.

// When USB CDC is enabled, Serial refers to SerialUSB, otherwise it refers to Serial1.
#if defined(CDC_ONLY) || defined(CDC_HID) || defined(WITH_CDC)
#define Serial                      SerialUSB
#else
#define Serial                      Serial0
#endif



#define  PCOM_NB 7

#if defined( _SPI_H_INCLUDED) && defined( TwoWire_h)  && defined( cores_usart_h) 

  extern SPIClass SPI0;
  extern SPIClass SPI0_BIS;
  extern SPIClass SPI1;
  extern SPIClass SPI2;
  extern SPIClass SPI3;
  extern SPIClass SPI4;
  extern SPIClass SPI5;

  extern TwoWire Wire0;
  extern TwoWire Wire1;
  extern TwoWire Wire2;
  extern TwoWire Wire3;
  extern TwoWire Wire4;
  extern TwoWire Wire5;
#endif

#define P_COM g_PComDescription
#define P_COM0 g_PComDescription[0]
#define P_COM1 g_PComDescription[1]
#define P_COM2 g_PComDescription[2]
#define P_COM3 g_PComDescription[3]
#define P_COM4 g_PComDescription[4]
#define P_COM5 g_PComDescription[5]
#define P_COM0_BIS g_PComDescription[6]

#define P_ANA0 g_PAnaDescription[0]
#define P_ANA1 g_PAnaDescription[1]


#if defined(BOARD_ID_engi)
// new one #define SerialFTDI      Serial1B

#define FTDI_Serial 	SerialFTDI
#else
#define SerialFTDI      Serial1B
#define FTDI_Serial 	SerialFTDI
#endif


#endif /* _VARIANT_ARDUINO_PILO_ */
